checkPinAssignment
verify_drc
verifyGeometry
verifyConnectivity
